----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/chujunchen/Desktop/ECON 0466/Research Paper/DHS2019-2021/summary_sta
> tistics.log
  log type:  text
 opened on:   2 May 2023, 15:08:34

. 
end of do-file

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. outreg2 using summary_statistics.log, replace excel summarize(cough birthweight height
> forage cookfuel education wealthindex smoke urban insurance state) stat(mean sd min ma
> x N) label
option summarize() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. sum ibn.cough birthweight heightforage ibn.cookfuel ibn.education ibn.wealthindex ibn.
> smoke ibn.urban ibn.insurance ibn.state

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       cough |
         no  |    161,463    .8700507    .3362487          0          1
yes, last..  |    161,463    .1299493    .3362487          0          1
             |
 birthweight |    166,041    2.821725    .5540693         .5          5
heightforage |    166,041   -1.714857    .8106273         -3       3.96
             |
    cookfuel |
electricity  |    166,041     .011467    .1064689          0          1
-------------+---------------------------------------------------------
        lpg  |    166,041    .4673665    .4989354          0          1
     biogas  |    166,041    .0034389    .0585415          0          1
   kerosene  |    166,041    .0040171    .0632532          0          1
coal, lig..  |    166,041    .0079679    .0889071          0          1
   charcoal  |    166,041    .0085039    .0918241          0          1
-------------+---------------------------------------------------------
       wood  |    166,041    .4224499    .4939509          0          1
straw/shr~s  |    166,041    .0098771    .0988918          0          1
agricultu..  |    166,041    .0182425    .1338275          0          1
animal dung  |    166,041    .0457116    .2088596          0          1
no food c..  |    166,041    .0000723     .008501          0          1
-------------+---------------------------------------------------------
      other  |    166,041    .0008853    .0297413          0          1
             |
   education |
no educat..  |    166,041    .1879476    .3906715          0          1
    primary  |    166,041    .1200426    .3250124          0          1
  secondary  |    166,041     .540234    .4983801          0          1
     higher  |    166,041    .1517758    .3588045          0          1
-------------+---------------------------------------------------------
             |
 wealthindex |
    poorest  |    166,041    .2286604    .4199713          0          1
     poorer  |    166,041      .22589    .4181683          0          1
     middle  |    166,041     .205124    .4037934          0          1
     richer  |    166,041    .1876464    .3904307          0          1
    richest  |    166,041    .1526792     .359679          0          1
-------------+---------------------------------------------------------
             |
       smoke |
         no  |    166,041    .9984281    .0396162          0          1
        yes  |    166,041    .0015719    .0396162          0          1
             |
       urban |
      urban  |    166,041     .217109    .4122787          0          1
      rural  |    166,041     .782891    .4122787          0          1
             |
   insurance |
         no  |    166,041    .7122277    .4527258          0          1
-------------+---------------------------------------------------------
        yes  |    166,041    .2877723    .4527258          0          1
             |
       state |
jammu & k..  |    166,041     .029047    .1679389          0          1
himachal ..  |    166,041    .0130028    .1132864          0          1
     punjab  |    166,041    .0271379    .1624856          0          1
 chandigarh  |    166,041    .0008251    .0287127          0          1
-------------+---------------------------------------------------------
uttarakhand  |    166,041     .016514    .1274417          0          1
    haryana  |    166,041    .0333171    .1794638          0          1
nct of de..  |    166,041    .0128643    .1126893          0          1
  rajasthan  |    166,041    .0725062     .259325          0          1
uttar pra..  |    166,041    .1338344    .3404753          0          1
-------------+---------------------------------------------------------
      bihar  |    166,041     .066598    .2493253          0          1
     sikkim  |    166,041    .0030655    .0552823          0          1
arunachal..  |    166,041    .0228076    .1492902          0          1
   nagaland  |    166,041     .008534    .0919851          0          1
    manipur  |    166,041    .0129004    .1128454          0          1
-------------+---------------------------------------------------------
    mizoram  |    166,041    .0119308    .1085749          0          1
    tripura  |    166,041    .0084377    .0914687          0          1
  meghalaya  |    166,041    .0240844    .1533118          0          1
      assam  |    166,041    .0478918    .2135379          0          1
west bengal  |    166,041    .0249637     .156015          0          1
-------------+---------------------------------------------------------
  jharkhand  |    166,041    .0365934    .1877618          0          1
     odisha  |    166,041    .0390265    .1936586          0          1
chhattisg~h  |    166,041    .0403997    .1968953          0          1
madhya pr..  |    166,041    .0734216    .2608281          0          1
    gujarat  |    166,041    .0481628    .2141108          0          1
-------------+---------------------------------------------------------
dadra & n..  |    166,041    .0037039    .0607471          0          1
maharashtra  |    166,041    .0450913     .207505          0          1
andhra pr..  |    166,041    .0125993    .1115376          0          1
  karnataka  |    166,041    .0389783    .1935439          0          1
        goa  |    166,041     .001867    .0431687          0          1
-------------+---------------------------------------------------------
lakshadweep  |    166,041    .0015177    .0389282          0          1
     kerala  |    166,041    .0146048     .119965          0          1
 tamil nadu  |    166,041    .0321547    .1764114          0          1
 puducherry  |    166,041    .0039147    .0624451          0          1
andaman &..  |    166,041    .0023548    .0484697          0          1
-------------+---------------------------------------------------------
  telangana  |    166,041    .0327088    .1778739          0          1
     ladakh  |    166,041    .0026379    .0512929          0          1

. 
end of do-file

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. sum ibn.cough birthweight heightforage ibn.cookfuel ibn.education ibn.wealthindex ibn.
> smoke ibn.urban ibn.insurance ibn.state

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       cough |
         no  |    161,463    .8700507    .3362487          0          1
yes, last..  |    161,463    .1299493    .3362487          0          1
             |
 birthweight |    166,041    2.821725    .5540693         .5          5
heightforage |    166,041   -1.714857    .8106273         -3       3.96
             |
    cookfuel |
electricity  |    166,041     .011467    .1064689          0          1
-------------+---------------------------------------------------------
        lpg  |    166,041    .4673665    .4989354          0          1
     biogas  |    166,041    .0034389    .0585415          0          1
   kerosene  |    166,041    .0040171    .0632532          0          1
coal, lig..  |    166,041    .0079679    .0889071          0          1
   charcoal  |    166,041    .0085039    .0918241          0          1
-------------+---------------------------------------------------------
       wood  |    166,041    .4224499    .4939509          0          1
straw/shr~s  |    166,041    .0098771    .0988918          0          1
agricultu..  |    166,041    .0182425    .1338275          0          1
animal dung  |    166,041    .0457116    .2088596          0          1
no food c..  |    166,041    .0000723     .008501          0          1
-------------+---------------------------------------------------------
      other  |    166,041    .0008853    .0297413          0          1
             |
   education |
no educat..  |    166,041    .1879476    .3906715          0          1
    primary  |    166,041    .1200426    .3250124          0          1
  secondary  |    166,041     .540234    .4983801          0          1
     higher  |    166,041    .1517758    .3588045          0          1
-------------+---------------------------------------------------------
             |
 wealthindex |
    poorest  |    166,041    .2286604    .4199713          0          1
     poorer  |    166,041      .22589    .4181683          0          1
     middle  |    166,041     .205124    .4037934          0          1
     richer  |    166,041    .1876464    .3904307          0          1
    richest  |    166,041    .1526792     .359679          0          1
-------------+---------------------------------------------------------
             |
       smoke |
         no  |    166,041    .9984281    .0396162          0          1
        yes  |    166,041    .0015719    .0396162          0          1
             |
       urban |
      urban  |    166,041     .217109    .4122787          0          1
      rural  |    166,041     .782891    .4122787          0          1
             |
   insurance |
         no  |    166,041    .7122277    .4527258          0          1
-------------+---------------------------------------------------------
        yes  |    166,041    .2877723    .4527258          0          1
             |
       state |
jammu & k..  |    166,041     .029047    .1679389          0          1
himachal ..  |    166,041    .0130028    .1132864          0          1
     punjab  |    166,041    .0271379    .1624856          0          1
 chandigarh  |    166,041    .0008251    .0287127          0          1
-------------+---------------------------------------------------------
uttarakhand  |    166,041     .016514    .1274417          0          1
    haryana  |    166,041    .0333171    .1794638          0          1
nct of de..  |    166,041    .0128643    .1126893          0          1
  rajasthan  |    166,041    .0725062     .259325          0          1
uttar pra..  |    166,041    .1338344    .3404753          0          1
-------------+---------------------------------------------------------
      bihar  |    166,041     .066598    .2493253          0          1
     sikkim  |    166,041    .0030655    .0552823          0          1
arunachal..  |    166,041    .0228076    .1492902          0          1
   nagaland  |    166,041     .008534    .0919851          0          1
    manipur  |    166,041    .0129004    .1128454          0          1
-------------+---------------------------------------------------------
    mizoram  |    166,041    .0119308    .1085749          0          1
    tripura  |    166,041    .0084377    .0914687          0          1
  meghalaya  |    166,041    .0240844    .1533118          0          1
      assam  |    166,041    .0478918    .2135379          0          1
west bengal  |    166,041    .0249637     .156015          0          1
-------------+---------------------------------------------------------
  jharkhand  |    166,041    .0365934    .1877618          0          1
     odisha  |    166,041    .0390265    .1936586          0          1
chhattisg~h  |    166,041    .0403997    .1968953          0          1
madhya pr..  |    166,041    .0734216    .2608281          0          1
    gujarat  |    166,041    .0481628    .2141108          0          1
-------------+---------------------------------------------------------
dadra & n..  |    166,041    .0037039    .0607471          0          1
maharashtra  |    166,041    .0450913     .207505          0          1
andhra pr..  |    166,041    .0125993    .1115376          0          1
  karnataka  |    166,041    .0389783    .1935439          0          1
        goa  |    166,041     .001867    .0431687          0          1
-------------+---------------------------------------------------------
lakshadweep  |    166,041    .0015177    .0389282          0          1
     kerala  |    166,041    .0146048     .119965          0          1
 tamil nadu  |    166,041    .0321547    .1764114          0          1
 puducherry  |    166,041    .0039147    .0624451          0          1
andaman &..  |    166,041    .0023548    .0484697          0          1
-------------+---------------------------------------------------------
  telangana  |    166,041    .0327088    .1778739          0          1
     ladakh  |    166,041    .0026379    .0512929          0          1

. 
end of do-file

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. outreg2 using results, excel
/Users/chujunchen/Library/Application Support/Stata/ado/plus/o/outreg2.ado
results.xml
dir : seeout

. 
end of do-file

. seeout using "results.txt"
Hit Enter to continue. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000
> 000"

. DHS_cleaned
command DHS_cleaned is unrecognized
r(199);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. describe DHS_cleaned
variable DHS_cleaned not found
r(111);

end of do-file

r(111);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. use DHS_cleaned
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. use DHS_cleaned.dta
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. 
. use "/Users/chujunchen/Desktop/ECON 0466/Research Paper/DHS2019-2021/DHS_cleaned.dta"
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "/var/folders/qx/9n1xxwfn0clbmwzd2d10qn340000gn/T//SD81196.000000"

. use "/Users/chujunchen/Desktop/ECON 0466/Research Paper/DHS2019-2021/DHS_cleaned.dta"
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. exit, clear
